backEnd/api/test/v1-stress.yml
config:
  target: "http://localhost:4000"
  phases:
    - name: ramp-up
      duration: 120
      arrivalRate: 10
      rampTo : 300
  timeout: 6
  plugins:
    ensure: { }
  ensure:
    maxErrorRate: 1
    thresholds:
      - "http.response_time.p99" : 6000
    condition:
      - strict: true
scenarios:
  - name: Run Code V1
    flow:
      - post:
          url : "/run/v1"
          json:
            code: "print('Hello World!')"
            language: "python"